ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_pin_control_2.h
/**
 * \brief Component description for PIC32CX/0525SG12 GPIO_PIN_CONTROL_2
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_GPIO_PIN_CONTROL_2_COMPONENT_H_
#define _PIC32CX_0525SG12_GPIO_PIN_CONTROL_2_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_GPIO_PIN_CONTROL_2 GPIO Pin Control 2 Registers
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR GPIO_PIN_CONTROL_2 */
/* ========================================================================== */

/* -------- GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x00) (R/W 32) GPIO 000 PIN CONTROL REGISTER 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2) GPIO 000 PIN CONTROL REGISTER 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x08) (R/W 32) GPIO 002 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2) GPIO 002 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x0c) (R/W 32) GPIO 003 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2) GPIO 003 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2) Register Mask  */

