ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_pin_control_2.h
#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2) GPIO 075 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0xf8) (R/W 32) GPIO 076 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2) GPIO 076 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x100) (R/W 32) GPIO 100 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2) GPIO 100 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x104) (R/W 32) GPIO 101 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2) GPIO 101 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x108) (R/W 32) GPIO 102 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2) GPIO 102 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_104_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x110) (R/W 32) GPIO 104 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_104_PIN_CONTROL_2_bits_t;
