ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_pin_control_2.h
#define GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_256_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x2bc) (R/W 32) GPIO 257 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2) GPIO 257 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_257_PIN_CONTROL_2) Register Mask  */

/* -------- GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2 : (GPIO_PIN_CONTROL_2 Offset: 0x2c0) (R/W 32) GPIO 260 Pin Control 2 -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t DRIVE_STRENGTH:2;          /**< bit:   4..5  These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_bits_t;
#define GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_RESETVALUE (0x00U)                                       /**<  (GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2) GPIO 260 Pin Control 2  Reset Value */

#define GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH_Pos (4)                                            /**< (GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Position */
#define GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH_Msk (0x3U << GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH_Pos)  /**< (GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2) These bits are used to select the drive strength on the pin. The drive strength is the same whether the pin is\n   powered by 3.3V or 1.8V. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA Mask */
#define GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH(value) (GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH_Msk & ((value) << GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_DRIVE_STRENGTH_Pos))
#define GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2_Msk (0x00000030UL)                                 /**< (GPIO_PIN_CONTROL_2_GPIO_260_PIN_CONTROL_2) Register Mask  */

/** \brief GPIO_PIN_CONTROL_2 register offsets definitions */
#define GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2_OFFSET (0x00)         /**< (GPIO_PIN_CONTROL_2_GPIO_000_PIN_CONTROL_2) GPIO 000 PIN CONTROL REGISTER 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2_OFFSET (0x08)         /**< (GPIO_PIN_CONTROL_2_GPIO_002_PIN_CONTROL_2) GPIO 002 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2_OFFSET (0x0C)         /**< (GPIO_PIN_CONTROL_2_GPIO_003_PIN_CONTROL_2) GPIO 003 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_004_PIN_CONTROL_2_OFFSET (0x10)         /**< (GPIO_PIN_CONTROL_2_GPIO_004_PIN_CONTROL_2) GPIO 004 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_007_PIN_CONTROL_2_OFFSET (0x1C)         /**< (GPIO_PIN_CONTROL_2_GPIO_007_PIN_CONTROL_2) GPIO 007 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_010_PIN_CONTROL_2_OFFSET (0x20)         /**< (GPIO_PIN_CONTROL_2_GPIO_010_PIN_CONTROL_2) GPIO 010 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_011_PIN_CONTROL_2_OFFSET (0x24)         /**< (GPIO_PIN_CONTROL_2_GPIO_011_PIN_CONTROL_2) GPIO 011 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_012_PIN_CONTROL_2_OFFSET (0x28)         /**< (GPIO_PIN_CONTROL_2_GPIO_012_PIN_CONTROL_2) GPIO 012 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_013_PIN_CONTROL_2_OFFSET (0x2C)         /**< (GPIO_PIN_CONTROL_2_GPIO_013_PIN_CONTROL_2) GPIO 013 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_014_PIN_CONTROL_2_OFFSET (0x30)         /**< (GPIO_PIN_CONTROL_2_GPIO_014_PIN_CONTROL_2) GPIO 014 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_015_PIN_CONTROL_2_OFFSET (0x34)         /**< (GPIO_PIN_CONTROL_2_GPIO_015_PIN_CONTROL_2) GPIO 015 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_016_PIN_CONTROL_2_OFFSET (0x38)         /**< (GPIO_PIN_CONTROL_2_GPIO_016_PIN_CONTROL_2) GPIO 016 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_017_PIN_CONTROL_2_OFFSET (0x3C)         /**< (GPIO_PIN_CONTROL_2_GPIO_017_PIN_CONTROL_2) GPIO 017 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_020_PIN_CONTROL_2_OFFSET (0x40)         /**< (GPIO_PIN_CONTROL_2_GPIO_020_PIN_CONTROL_2) GPIO 020 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_021_PIN_CONTROL_2_OFFSET (0x44)         /**< (GPIO_PIN_CONTROL_2_GPIO_021_PIN_CONTROL_2) GPIO 021 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_022_PIN_CONTROL_2_OFFSET (0x48)         /**< (GPIO_PIN_CONTROL_2_GPIO_022_PIN_CONTROL_2) GPIO 022 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_023_PIN_CONTROL_2_OFFSET (0x4C)         /**< (GPIO_PIN_CONTROL_2_GPIO_023_PIN_CONTROL_2) GPIO 023 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_024_PIN_CONTROL_2_OFFSET (0x50)         /**< (GPIO_PIN_CONTROL_2_GPIO_024_PIN_CONTROL_2) GPIO 024 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_025_PIN_CONTROL_2_OFFSET (0x54)         /**< (GPIO_PIN_CONTROL_2_GPIO_025_PIN_CONTROL_2) GPIO 025 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_026_PIN_CONTROL_2_OFFSET (0x58)         /**< (GPIO_PIN_CONTROL_2_GPIO_026_PIN_CONTROL_2) GPIO 026 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_027_PIN_CONTROL_2_OFFSET (0x5C)         /**< (GPIO_PIN_CONTROL_2_GPIO_027_PIN_CONTROL_2) GPIO 027 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_030_PIN_CONTROL_2_OFFSET (0x60)         /**< (GPIO_PIN_CONTROL_2_GPIO_030_PIN_CONTROL_2) GPIO 030 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_031_PIN_CONTROL_2_OFFSET (0x64)         /**< (GPIO_PIN_CONTROL_2_GPIO_031_PIN_CONTROL_2) GPIO 031 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_032_PIN_CONTROL_2_OFFSET (0x68)         /**< (GPIO_PIN_CONTROL_2_GPIO_032_PIN_CONTROL_2) GPIO 032 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_033_PIN_CONTROL_2_OFFSET (0x6C)         /**< (GPIO_PIN_CONTROL_2_GPIO_033_PIN_CONTROL_2) GPIO 033 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_034_PIN_CONTROL_2_OFFSET (0x70)         /**< (GPIO_PIN_CONTROL_2_GPIO_034_PIN_CONTROL_2) GPIO 034 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_035_PIN_CONTROL_2_OFFSET (0x74)         /**< (GPIO_PIN_CONTROL_2_GPIO_035_PIN_CONTROL_2) GPIO 035 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_036_PIN_CONTROL_2_OFFSET (0x78)         /**< (GPIO_PIN_CONTROL_2_GPIO_036_PIN_CONTROL_2) GPIO 036 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_040_PIN_CONTROL_2_OFFSET (0x80)         /**< (GPIO_PIN_CONTROL_2_GPIO_040_PIN_CONTROL_2) GPIO 040 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_042_PIN_CONTROL_2_OFFSET (0x88)         /**< (GPIO_PIN_CONTROL_2_GPIO_042_PIN_CONTROL_2) GPIO 042 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_043_PIN_CONTROL_2_OFFSET (0x8C)         /**< (GPIO_PIN_CONTROL_2_GPIO_043_PIN_CONTROL_2) GPIO 043 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_044_PIN_CONTROL_2_OFFSET (0x90)         /**< (GPIO_PIN_CONTROL_2_GPIO_044_PIN_CONTROL_2) GPIO 044 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_045_PIN_CONTROL_2_OFFSET (0x94)         /**< (GPIO_PIN_CONTROL_2_GPIO_045_PIN_CONTROL_2) GPIO 045 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_046_PIN_CONTROL_2_OFFSET (0x98)         /**< (GPIO_PIN_CONTROL_2_GPIO_046_PIN_CONTROL_2) GPIO 046 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_047_PIN_CONTROL_2_OFFSET (0x9C)         /**< (GPIO_PIN_CONTROL_2_GPIO_047_PIN_CONTROL_2) GPIO 047 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_050_PIN_CONTROL_2_OFFSET (0xA0)         /**< (GPIO_PIN_CONTROL_2_GPIO_050_PIN_CONTROL_2) GPIO 050 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_051_PIN_CONTROL_2_OFFSET (0xA4)         /**< (GPIO_PIN_CONTROL_2_GPIO_051_PIN_CONTROL_2) GPIO 051 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_052_PIN_CONTROL_2_OFFSET (0xA8)         /**< (GPIO_PIN_CONTROL_2_GPIO_052_PIN_CONTROL_2) GPIO 052 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_053_PIN_CONTROL_2_OFFSET (0xAC)         /**< (GPIO_PIN_CONTROL_2_GPIO_053_PIN_CONTROL_2) GPIO 053 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_054_PIN_CONTROL_2_OFFSET (0xB0)         /**< (GPIO_PIN_CONTROL_2_GPIO_054_PIN_CONTROL_2) GPIO 054 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_055_PIN_CONTROL_2_OFFSET (0xB4)         /**< (GPIO_PIN_CONTROL_2_GPIO_055_PIN_CONTROL_2) GPIO 055 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_056_PIN_CONTROL_2_OFFSET (0xB8)         /**< (GPIO_PIN_CONTROL_2_GPIO_056_PIN_CONTROL_2) GPIO 056 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_057_PIN_CONTROL_2_OFFSET (0xBC)         /**< (GPIO_PIN_CONTROL_2_GPIO_057_PIN_CONTROL_2) GPIO 057 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_060_PIN_CONTROL_2_OFFSET (0xC0)         /**< (GPIO_PIN_CONTROL_2_GPIO_060_PIN_CONTROL_2) GPIO 060 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_061_PIN_CONTROL_2_OFFSET (0xC4)         /**< (GPIO_PIN_CONTROL_2_GPIO_061_PIN_CONTROL_2) GPIO 061 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_062_PIN_CONTROL_2_OFFSET (0xC8)         /**< (GPIO_PIN_CONTROL_2_GPIO_062_PIN_CONTROL_2) GPIO 062 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_063_PIN_CONTROL_2_OFFSET (0xCC)         /**< (GPIO_PIN_CONTROL_2_GPIO_063_PIN_CONTROL_2) GPIO 063 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_064_PIN_CONTROL_2_OFFSET (0xD0)         /**< (GPIO_PIN_CONTROL_2_GPIO_064_PIN_CONTROL_2) GPIO 064 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_065_PIN_CONTROL_2_OFFSET (0xD4)         /**< (GPIO_PIN_CONTROL_2_GPIO_065_PIN_CONTROL_2) GPIO 065 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_066_PIN_CONTROL_2_OFFSET (0xD8)         /**< (GPIO_PIN_CONTROL_2_GPIO_066_PIN_CONTROL_2) GPIO 066 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_067_PIN_CONTROL_2_OFFSET (0xDC)         /**< (GPIO_PIN_CONTROL_2_GPIO_067_PIN_CONTROL_2) GPIO 067 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_070_PIN_CONTROL_2_OFFSET (0xE0)         /**< (GPIO_PIN_CONTROL_2_GPIO_070_PIN_CONTROL_2) GPIO 070 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_071_PIN_CONTROL_2_OFFSET (0xE4)         /**< (GPIO_PIN_CONTROL_2_GPIO_071_PIN_CONTROL_2) GPIO 071 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_072_PIN_CONTROL_2_OFFSET (0xE8)         /**< (GPIO_PIN_CONTROL_2_GPIO_072_PIN_CONTROL_2) GPIO 072 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_073_PIN_CONTROL_2_OFFSET (0xEC)         /**< (GPIO_PIN_CONTROL_2_GPIO_073_PIN_CONTROL_2) GPIO 073 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_074_PIN_CONTROL_2_OFFSET (0xF0)         /**< (GPIO_PIN_CONTROL_2_GPIO_074_PIN_CONTROL_2) GPIO 074 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2_OFFSET (0xF4)         /**< (GPIO_PIN_CONTROL_2_GPIO_075_PIN_CONTROL_2) GPIO 075 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2_OFFSET (0xF8)         /**< (GPIO_PIN_CONTROL_2_GPIO_076_PIN_CONTROL_2) GPIO 076 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2_OFFSET (0x100)        /**< (GPIO_PIN_CONTROL_2_GPIO_100_PIN_CONTROL_2) GPIO 100 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2_OFFSET (0x104)        /**< (GPIO_PIN_CONTROL_2_GPIO_101_PIN_CONTROL_2) GPIO 101 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2_OFFSET (0x108)        /**< (GPIO_PIN_CONTROL_2_GPIO_102_PIN_CONTROL_2) GPIO 102 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_104_PIN_CONTROL_2_OFFSET (0x110)        /**< (GPIO_PIN_CONTROL_2_GPIO_104_PIN_CONTROL_2) GPIO 104 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_105_PIN_CONTROL_2_OFFSET (0x114)        /**< (GPIO_PIN_CONTROL_2_GPIO_105_PIN_CONTROL_2) GPIO 105 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_106_PIN_CONTROL_2_OFFSET (0x118)        /**< (GPIO_PIN_CONTROL_2_GPIO_106_PIN_CONTROL_2) GPIO 106 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_107_PIN_CONTROL_2_OFFSET (0x11C)        /**< (GPIO_PIN_CONTROL_2_GPIO_107_PIN_CONTROL_2) GPIO 107 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_112_PIN_CONTROL_2_OFFSET (0x128)        /**< (GPIO_PIN_CONTROL_2_GPIO_112_PIN_CONTROL_2) GPIO 112 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_113_PIN_CONTROL_2_OFFSET (0x12C)        /**< (GPIO_PIN_CONTROL_2_GPIO_113_PIN_CONTROL_2) GPIO 113 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_114_PIN_CONTROL_2_OFFSET (0x130)        /**< (GPIO_PIN_CONTROL_2_GPIO_114_PIN_CONTROL_2) GPIO 114 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_115_PIN_CONTROL_2_OFFSET (0x134)        /**< (GPIO_PIN_CONTROL_2_GPIO_115_PIN_CONTROL_2) GPIO 115 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_116_PIN_CONTROL_2_OFFSET (0x138)        /**< (GPIO_PIN_CONTROL_2_GPIO_116_PIN_CONTROL_2) GPIO 116 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_117_PIN_CONTROL_2_OFFSET (0x13C)        /**< (GPIO_PIN_CONTROL_2_GPIO_117_PIN_CONTROL_2) GPIO 117 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_120_PIN_CONTROL_2_OFFSET (0x140)        /**< (GPIO_PIN_CONTROL_2_GPIO_120_PIN_CONTROL_2) GPIO 120 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_121_PIN_CONTROL_2_OFFSET (0x144)        /**< (GPIO_PIN_CONTROL_2_GPIO_121_PIN_CONTROL_2) GPIO 121 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_122_PIN_CONTROL_2_OFFSET (0x148)        /**< (GPIO_PIN_CONTROL_2_GPIO_122_PIN_CONTROL_2) GPIO 122 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_123_PIN_CONTROL_2_OFFSET (0x14C)        /**< (GPIO_PIN_CONTROL_2_GPIO_123_PIN_CONTROL_2) GPIO 123 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_124_PIN_CONTROL_2_OFFSET (0x150)        /**< (GPIO_PIN_CONTROL_2_GPIO_124_PIN_CONTROL_2) GPIO 124 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_125_PIN_CONTROL_2_OFFSET (0x154)        /**< (GPIO_PIN_CONTROL_2_GPIO_125_PIN_CONTROL_2) GPIO 125 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_126_PIN_CONTROL_2_OFFSET (0x158)        /**< (GPIO_PIN_CONTROL_2_GPIO_126_PIN_CONTROL_2) GPIO 126 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_127_PIN_CONTROL_2_OFFSET (0x15C)        /**< (GPIO_PIN_CONTROL_2_GPIO_127_PIN_CONTROL_2) GPIO 127 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_130_PIN_CONTROL_2_OFFSET (0x160)        /**< (GPIO_PIN_CONTROL_2_GPIO_130_PIN_CONTROL_2) GPIO 130 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_131_PIN_CONTROL_2_OFFSET (0x164)        /**< (GPIO_PIN_CONTROL_2_GPIO_131_PIN_CONTROL_2) GPIO 131 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_132_PIN_CONTROL_2_OFFSET (0x168)        /**< (GPIO_PIN_CONTROL_2_GPIO_132_PIN_CONTROL_2) GPIO 132 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_140_PIN_CONTROL_2_OFFSET (0x180)        /**< (GPIO_PIN_CONTROL_2_GPIO_140_PIN_CONTROL_2) GPIO 140 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_141_PIN_CONTROL_2_OFFSET (0x184)        /**< (GPIO_PIN_CONTROL_2_GPIO_141_PIN_CONTROL_2) GPIO 141 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_142_PIN_CONTROL_2_OFFSET (0x188)        /**< (GPIO_PIN_CONTROL_2_GPIO_142_PIN_CONTROL_2) GPIO 142 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_143_PIN_CONTROL_2_OFFSET (0x18C)        /**< (GPIO_PIN_CONTROL_2_GPIO_143_PIN_CONTROL_2) GPIO 143 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_144_PIN_CONTROL_2_OFFSET (0x190)        /**< (GPIO_PIN_CONTROL_2_GPIO_144_PIN_CONTROL_2) GPIO 144 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_145_PIN_CONTROL_2_OFFSET (0x194)        /**< (GPIO_PIN_CONTROL_2_GPIO_145_PIN_CONTROL_2) GPIO 145 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_146_PIN_CONTROL_2_OFFSET (0x198)        /**< (GPIO_PIN_CONTROL_2_GPIO_146_PIN_CONTROL_2) GPIO 146 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_147_PIN_CONTROL_2_OFFSET (0x19C)        /**< (GPIO_PIN_CONTROL_2_GPIO_147_PIN_CONTROL_2) GPIO 147 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_150_PIN_CONTROL_2_OFFSET (0x1A0)        /**< (GPIO_PIN_CONTROL_2_GPIO_150_PIN_CONTROL_2) GPIO 150 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_151_PIN_CONTROL_2_OFFSET (0x1A4)        /**< (GPIO_PIN_CONTROL_2_GPIO_151_PIN_CONTROL_2) GPIO 151 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_152_PIN_CONTROL_2_OFFSET (0x1A8)        /**< (GPIO_PIN_CONTROL_2_GPIO_152_PIN_CONTROL_2) GPIO 152 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_153_PIN_CONTROL_2_OFFSET (0x1AC)        /**< (GPIO_PIN_CONTROL_2_GPIO_153_PIN_CONTROL_2) GPIO 153 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_154_PIN_CONTROL_2_OFFSET (0x1B0)        /**< (GPIO_PIN_CONTROL_2_GPIO_154_PIN_CONTROL_2) GPIO 154 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_155_PIN_CONTROL_2_OFFSET (0x1B4)        /**< (GPIO_PIN_CONTROL_2_GPIO_155_PIN_CONTROL_2) GPIO 155 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_156_PIN_CONTROL_2_OFFSET (0x1B8)        /**< (GPIO_PIN_CONTROL_2_GPIO_156_PIN_CONTROL_2) GPIO 156 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_157_PIN_CONTROL_2_OFFSET (0x1BC)        /**< (GPIO_PIN_CONTROL_2_GPIO_157_PIN_CONTROL_2) GPIO 157 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_161_PIN_CONTROL_2_OFFSET (0x1C4)        /**< (GPIO_PIN_CONTROL_2_GPIO_161_PIN_CONTROL_2) GPIO 161 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_162_PIN_CONTROL_2_OFFSET (0x1C8)        /**< (GPIO_PIN_CONTROL_2_GPIO_162_PIN_CONTROL_2) GPIO 162 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_163_PIN_CONTROL_2_OFFSET (0x1CC)        /**< (GPIO_PIN_CONTROL_2_GPIO_163_PIN_CONTROL_2) GPIO 163 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_165_PIN_CONTROL_2_OFFSET (0x1D4)        /**< (GPIO_PIN_CONTROL_2_GPIO_165_PIN_CONTROL_2) GPIO 165 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_170_PIN_CONTROL_2_OFFSET (0x1E0)        /**< (GPIO_PIN_CONTROL_2_GPIO_170_PIN_CONTROL_2) GPIO 170 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_171_PIN_CONTROL_2_OFFSET (0x1E4)        /**< (GPIO_PIN_CONTROL_2_GPIO_171_PIN_CONTROL_2) GPIO 171 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_172_PIN_CONTROL_2_OFFSET (0x1E8)        /**< (GPIO_PIN_CONTROL_2_GPIO_172_PIN_CONTROL_2) GPIO 172 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_175_PIN_CONTROL_2_OFFSET (0x1F4)        /**< (GPIO_PIN_CONTROL_2_GPIO_175_PIN_CONTROL_2) GPIO 175 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_200_PIN_CONTROL_2_OFFSET (0x200)        /**< (GPIO_PIN_CONTROL_2_GPIO_200_PIN_CONTROL_2) GPIO 200 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_201_PIN_CONTROL_2_OFFSET (0x204)        /**< (GPIO_PIN_CONTROL_2_GPIO_201_PIN_CONTROL_2) GPIO 201 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_202_PIN_CONTROL_2_OFFSET (0x208)        /**< (GPIO_PIN_CONTROL_2_GPIO_202_PIN_CONTROL_2) GPIO 202 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_203_PIN_CONTROL_2_OFFSET (0x20C)        /**< (GPIO_PIN_CONTROL_2_GPIO_203_PIN_CONTROL_2) GPIO 203 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_204_PIN_CONTROL_2_OFFSET (0x210)        /**< (GPIO_PIN_CONTROL_2_GPIO_204_PIN_CONTROL_2) GPIO 204 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_205_PIN_CONTROL_2_OFFSET (0x214)        /**< (GPIO_PIN_CONTROL_2_GPIO_205_PIN_CONTROL_2) GPIO 205 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_206_PIN_CONTROL_2_OFFSET (0x218)        /**< (GPIO_PIN_CONTROL_2_GPIO_206_PIN_CONTROL_2) GPIO 206 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_207_PIN_CONTROL_2_OFFSET (0x21C)        /**< (GPIO_PIN_CONTROL_2_GPIO_207_PIN_CONTROL_2) GPIO 207 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_210_PIN_CONTROL_2_OFFSET (0x220)        /**< (GPIO_PIN_CONTROL_2_GPIO_210_PIN_CONTROL_2) GPIO 210 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_211_PIN_CONTROL_2_OFFSET (0x224)        /**< (GPIO_PIN_CONTROL_2_GPIO_211_PIN_CONTROL_2) GPIO 211 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_212_PIN_CONTROL_2_OFFSET (0x228)        /**< (GPIO_PIN_CONTROL_2_GPIO_212_PIN_CONTROL_2) GPIO 212 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_213_PIN_CONTROL_2_OFFSET (0x22C)        /**< (GPIO_PIN_CONTROL_2_GPIO_213_PIN_CONTROL_2) GPIO 213 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_221_PIN_CONTROL_2_OFFSET (0x244)        /**< (GPIO_PIN_CONTROL_2_GPIO_221_PIN_CONTROL_2) GPIO 221 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_222_PIN_CONTROL_2_OFFSET (0x248)        /**< (GPIO_PIN_CONTROL_2_GPIO_222_PIN_CONTROL_2) GPIO 222 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_223_PIN_CONTROL_2_OFFSET (0x24C)        /**< (GPIO_PIN_CONTROL_2_GPIO_223_PIN_CONTROL_2) GPIO 223 Pin Control 2 Offset */
#define GPIO_PIN_CONTROL_2_GPIO_224_PIN_CONTROL_2_OFFSET (0x250)        /**< (GPIO_PIN_CONTROL_2_GPIO_224_PIN_CONTROL_2) GPIO 224 Pin Control 2 Offset */
